# Import data to My SQL from Csv

In [3]:
import pandas as pd
import pymysql
from sqlalchemy import create_engine
import os

In [4]:
file_path = 'E:\analytics\data\students2.csv'
print(file_path)

E:nalytics\data\students2.csv

In [5]:
file_path = 'C:\analytics\data\students2.csv'
print(file_path)

C:nalytics\data\students2.csv

In [6]:
df = pd.read_csv(file_path)
df.shape

OSError: [Errno 22] Invalid argument: 'C:\x07nalytics\\data\\students2.csv'

In [7]:
file_path = 'E:\analytics\data\students2.csv'
print(file_path)

E:nalytics\data\students2.csv

In [8]:
file_path = 'E:/analytics/data/students2.csv'
print(file_path)

E:/analytics/data/students2.csv

In [9]:
df = pd.read_csv(file_path)
df.shape

(30, 6)

In [10]:
df.head()

   rollno      name  gender         dob  height program
0       1  Jugurtha    Male  2000-08-16     156     BCA
1       2  Amandeep  Female  2000-02-21     170     BBA
2       3    Barkat  Female  2001-07-17     158     BCA
3       4    Suroor  Female  2001-11-16     188     BBA
4       5   Sultana    Male  2001-04-02     167     BCA

In [11]:
engine1=create_engine("mysql+pymysql://piuser:Pass%40123@localhost:3306/piit")
engine1

Engine(mysql+pymysql://piuser:***@localhost:3306/piit)

In [12]:
df.to_sql('students2', engine1, if_exists='append', index=False, chunksize=1000, method='multi')

30

In [13]:
df2 = pd.read_sql("SELECT * FROM students2;", engine1)
df2.head()

   rollno      name  gender         dob  height program
0       1  Jugurtha    Male  2000-08-16     156     BCA
1       2  Amandeep  Female  2000-02-21     170     BBA
2       3    Barkat  Female  2001-07-17     158     BCA
3       4    Suroor  Female  2001-11-16     188     BBA
4       5   Sultana    Male  2001-04-02     167     BCA

In [14]:
df2.to_csv('E:/analytics/data/students3.csv')

In [15]:
df2.to_excel('E:/analytics/data/students4.xlsx')

In [16]:
print(sorted(os.listdir('E:/analytics/data'), key=str.lower))

['employees.csv', 'mtcarsdata.csv', 'students2.csv', 'students3.csv', 'students3.xlsx', 'students4.xlsx']

In [17]:
df2a = pd.read_csv('E:/analytics/data/students3.csv')
df2a.shape

(90, 7)

In [18]:
csvfile = 'E:/analytics/data/students3.csv'
xlsfile =  'E:/analytics/data/students4.xlsx'

In [19]:
df2.to_csv(csvfile, index=False)

In [20]:
df2.to_excel(xlsfile, index=False)

In [21]:
df2b = pd.read_csv(csvfile)
df2b.shape

(90, 6)

In [22]:
df2c = pd.read_excel(xlsfile)
df2c.shape

(90, 6)

In [23]:
df2b

    rollno        name  gender         dob  height program
0        1    Jugurtha    Male  2000-08-16     156     BCA
1        2    Amandeep  Female  2000-02-21     170     BBA
2        3      Barkat  Female  2001-07-17     158     BCA
3        4      Suroor  Female  2001-11-16     188     BBA
4        5     Sultana    Male  2001-04-02     167     BCA
..     ...         ...     ...         ...     ...     ...
85      26  Student_26     NaN  2001-07-23     167     BBA
86      27  Student_27    Male  2000-11-14     175     BBA
87      28  Student_28  Female  2001-03-16     183     BBA
88      29  Student_29  Female  2001-11-20     159     BBA
89      30  Student_30    Male  2000-07-28     185     BBA

[90 rows x 6 columns]

In [24]:
df4 = df2b.copy()
df4

    rollno        name  gender         dob  height program
0        1    Jugurtha    Male  2000-08-16     156     BCA
1        2    Amandeep  Female  2000-02-21     170     BBA
2        3      Barkat  Female  2001-07-17     158     BCA
3        4      Suroor  Female  2001-11-16     188     BBA
4        5     Sultana    Male  2001-04-02     167     BCA
..     ...         ...     ...         ...     ...     ...
85      26  Student_26     NaN  2001-07-23     167     BBA
86      27  Student_27    Male  2000-11-14     175     BBA
87      28  Student_28  Female  2001-03-16     183     BBA
88      29  Student_29  Female  2001-11-20     159     BBA
89      30  Student_30    Male  2000-07-28     185     BBA

[90 rows x 6 columns]

In [25]:
df5 = pd.read_csv('E:/analytics/data/employees.csv')
df5.shape

(20, 1)

In [26]:
df6 = df5.copy()
df6

   employee_id;"first_name";"last_name";"department";"salary"
0                         1;"John";"Doe";"HR";50000.0
1                       2;"Jane";"Smith";"IT";60000.0
2               3;"Alice";"Johnson";"Finance";55000.0
3                     4;"Bob";"Williams";"IT";62000.0
4                      5;"Emily";"Brown";"HR";48000.0
5               6;"Michael";"Davis";"Finance";57000.0
6                    7;"Sophia";"Wilson";"IT";61000.0
7              8;"David";"Miller";"Marketing";53000.0
8                    9;"Olivia";"Taylor";"HR";49000.0
9             10;"James";"Anderson";"Finance";59000.0
10                      101;"John";"Doe";"HR";50000.0
11                    102;"Jane";"Smith";"IT";60000.0
12            103;"Alice";"Johnson";"Finance";55000.0
13                  104;"Bob";"Williams";"IT";62000.0
14                   105;"Emily";"Brown";"HR";48000.0
15            106;"Michael";"Davis";"Finance";57000.0
16                 107;"Sophia";"Wilson";"IT";61000.0
17           108;"David";"Miller";"Marketing";53000.0
18                 109;"Olivia";"Taylor";"HR";49000.0
19           110;"James";"Anderson";"Finance";59000.0

In [69]:
df6['employee_id'] = df6['employee_id']+200

KeyError: 'employee_id'

In [27]:
df5 = pd.read_csv('E:/analytics/data/employees.csv', sep=';')
df5.shape

(20, 5)

In [28]:
print(df5.columns)

Index(['employee_id', 'first_name', 'last_name', 'department', 'salary'], dtype='object')

In [29]:
df6 = df5.copy()
df6

    employee_id first_name last_name department   salary
0             1       John       Doe         HR  50000.0
1             2       Jane     Smith         IT  60000.0
2             3      Alice   Johnson    Finance  55000.0
3             4        Bob  Williams         IT  62000.0
4             5      Emily     Brown         HR  48000.0
5             6    Michael     Davis    Finance  57000.0
6             7     Sophia    Wilson         IT  61000.0
7             8      David    Miller  Marketing  53000.0
8             9     Olivia    Taylor         HR  49000.0
9            10      James  Anderson    Finance  59000.0
10          101       John       Doe         HR  50000.0
11          102       Jane     Smith         IT  60000.0
12          103      Alice   Johnson    Finance  55000.0
13          104        Bob  Williams         IT  62000.0
14          105      Emily     Brown         HR  48000.0
15          106    Michael     Davis    Finance  57000.0
16          107     Sophia    Wilson         IT  61000.0
17          108      David    Miller  Marketing  53000.0
18          109     Olivia    Taylor         HR  49000.0
19          110      James  Anderson    Finance  59000.0

In [30]:
df6['employee_id'] = df6['employee_id']+200

In [31]:
df6

    employee_id first_name last_name department   salary
0           201       John       Doe         HR  50000.0
1           202       Jane     Smith         IT  60000.0
2           203      Alice   Johnson    Finance  55000.0
3           204        Bob  Williams         IT  62000.0
4           205      Emily     Brown         HR  48000.0
5           206    Michael     Davis    Finance  57000.0
6           207     Sophia    Wilson         IT  61000.0
7           208      David    Miller  Marketing  53000.0
8           209     Olivia    Taylor         HR  49000.0
9           210      James  Anderson    Finance  59000.0
10          301       John       Doe         HR  50000.0
11          302       Jane     Smith         IT  60000.0
12          303      Alice   Johnson    Finance  55000.0
13          304        Bob  Williams         IT  62000.0
14          305      Emily     Brown         HR  48000.0
15          306    Michael     Davis    Finance  57000.0
16          307     Sophia    Wilson         IT  61000.0
17          308      David    Miller  Marketing  53000.0
18          309     Olivia    Taylor         HR  49000.0
19          310      James  Anderson    Finance  59000.0

In [32]:
df6.tail()

    employee_id first_name last_name department   salary
15          306    Michael     Davis    Finance  57000.0
16          307     Sophia    Wilson         IT  61000.0
17          308      David    Miller  Marketing  53000.0
18          309     Olivia    Taylor         HR  49000.0
19          310      James  Anderson    Finance  59000.0

In [33]:
df6 = pd.read_sql("SELECT * FROM employees", engine1)
df6

   employee_id     name  department_id
0            1    Alice            1.0
1            2      Bob            2.0
2            3  Charlie            1.0
3            4    David            3.0
4            5      Eve            NaN

In [34]:
df4.to_sql(  name='employees',    con=engine1,   if_exists='append',   # options: 'fail', 'replace', 'append'
    index=False )

OperationalError: (pymysql.err.OperationalError) (1054, "Unknown column 'rollno' in 'field list'")
[SQL: INSERT INTO employees (rollno, name, gender, dob, height, program) VALUES (%(rollno)s, %(name)s, %(gender)s, %(dob)s, %(height)s, %(program)s)]
[parameters: [{'rollno': 1, 'name': 'Jugurtha', 'gender': 'Male', 'dob': '2000-08-16', 'height': 156, 'program': 'BCA'}, {'rollno': 2, 'name': 'Amandeep', 'gender': 'Female', 'dob': '2000-02-21', 'height': 170, 'program': 'BBA'}, {'rollno': 3, 'name': 'Barkat', 'gender': 'Female', 'dob': '2001-07-17', 'height': 158, 'program': 'BCA'}, {'rollno': 4, 'name': 'Suroor', 'gender': 'Female', 'dob': '2001-11-16', 'height': 188, 'program': 'BBA'}, {'rollno': 5, 'name': 'Sultana', 'gender': 'Male', 'dob': '2001-04-02', 'height': 167, 'program': 'BCA'}, {'rollno': 6, 'name': 'Sajjad', 'gender': 'Male', 'dob': '2000-10-12', 'height': 153, 'program': 'BCA'}, {'rollno': 7, 'name': 'Sharan', 'gender': 'Male', 'dob': '2000-07-28', 'height': 174, 'program': 'BBA'}, {'rollno': 8, 'name': 'Djedjiga', 'gender': 'Female', 'dob': '2000-06-27', 'height': 163, 'program': 'BCA'}  ... displaying 10 of 90 total bound parameter sets ...  {'rollno': 29, 'name': 'Student_29', 'gender': 'Female', 'dob': '2001-11-20', 'height': 159, 'program': 'BBA'}, {'rollno': 30, 'name': 'Student_30', 'gender': 'Male', 'dob': '2000-07-28', 'height': 185, 'program': 'BBA'}]]
(Background on this error at: https://sqlalche.me/e/20/e3q8)